Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Vim has a set of so called "quickfix" commands.
es_es: Vim tiene un conjunto de órdenes de arreglos rápidos («quickfix»).

source: They enable you to compile a program from within Vim and then go through the errors generated and fix them (hopefully).
es_es: Permiten compilar un programa desde Vim y después navegar a través de los errores generados y (posiblemente) arreglarlos.

source: You can then recompile and fix any new errors that are found until finally your program compiles without any error.
es_es: Puede después recompilar y arreglar cualquier error nuevo detectado hasta que finalmente su programa se compile sin problemas.

source: If errors were generated, they are captured and the editor positions you where the first error occurred.
es_es: Si se genera algún error, se captura y el editor le posicionará sobre el primer error.

source: Take a look at an example ":make" session.
es_es: Este es un ejemplo de una sesión típica de «:make».

source: (Typical :make sessions generate far more errors and fewer stupid ones.) After typing ":make" the screen looks like this:
es_es: (Las sesiones típicas de «:make» generan muchos menos errores y menos errores estúpidos.) La pantalla presentará este aspecto después de teclear «:make»:

source: From this you can see that you have errors in the file "main.c".
es_es: Aquí puede ver que tiene errores en el archivo «main.c».

source: When you press <Enter>, Vim displays the file "main.c", with the cursor positioned on line 6, the first line with an error.
es_es: Cuando pulse <Intro>, Vim mostrará el archivo «main.c», con el cursor posicionado en la línea 6, la primera con un error.

source: You did not need to specify the file or the line number, Vim knew where to go by looking in the error messages.
es_es: No necesitó definir el archivo o el número de línea, ya que Vim sabe dónde ir analizando los mensajes de error.

source: Vim jumps to line 10, the last line in the file, where there is an extra '}'.
es_es: Vim salta a la línea 10, la última línea en el archivo, donde hay un «}» adicional.

source: When there is not enough room, Vim will shorten the error message.
es_es: Cuando no hay suficiente espacio Vim acorta el mensaje de error.

source: To see the whole message use: >
es_es: Para ver el mensaje completo, use lo siguiente: >

source: You can get an overview of all the error messages with the ":clist" command.
es_es: Puede obtener una visión general de todos los mensajes de error con la orden «:clist».

source: The output looks like this: >
es_es: La salida tiene el siguiente aspecto: >

source: Only the lines where Vim recognized a file name and line number are listed here.
es_es: Sólo se muestran las líneas donde Vim reconoció un nombre de archivo y un número de línea.

source: It assumes those are the interesting lines and the rest is just boring messages.
es_es: Asume que aquéllas son las líneas de interés, mientras que toma el resto como mensajes aburridos.

source: However, sometimes unrecognized lines do contain something you want to see.
es_es: Aún así, a veces las líneas no reconocidas contiene algo que desea ver.

source: Output from the linker, for example, about an undefined function.
es_es: Por ejemplo, la salida del enlazador acerca de una función no definida.

source: To see all the messages add a "!" to the command: >
es_es: Para ver todos los mensajes, añada «!» a la orden: >

source: Vim will highlight the current error.
es_es: Vim resaltará el error actual.

source: To go back to the previous error, use: > :cprevious
es_es: Use lo siguiente para volver al error anterior: > :cprevious

source: The name of the program to run when the ":make" command is executed is defined by the 'makeprg' option.
es_es: El nombre del programa a ejecutar cuando usa la orden «:make» se define con la opción 'makeprg'.

source: Usually this is set to "make", but Visual C++ users should set this to "nmake" by executing the following command: >
es_es: Habitualmente, esto se define como «make», pero usuarios de Visual C++ deberían definir esto como «nmake» ejecutando la siguiente orden: >

source: You can also include arguments in this option.
es_es: También puede incluir argumentos en esta opción.

source: Special characters need to be escaped with a backslash.
es_es: Los caracteres especiales se deben escapar con una barra inversa.

source: You can include special Vim keywords in the command specification.
es_es: Puede incluir palabras clave especiales de Vim al especificar la orden.

source: The % character expands to the name of the current file.
es_es: El carácter «%» se expande con el nombre del archivo actual.

source: So if you execute the command: > :set makeprg=make\ %
es_es: Así que se ejecuta la siguiente orden: > :set makeprg=make\ %

source: Suppose you ":make" a program.
es_es: Suponga que compila un programa con «:make».

source: There is a warning message in one file and an error message in another.
es_es: Hay un mensaje de aviso en un archivo y un mensaje de error en otro.

source: You fix the error and use ":make" again to check if it was really fixed.
es_es: Arregla el mensaje y usa «:make» otra vez para comprobar que lo ha arreglado.

source: Now you want to look at the warning message.
es_es: Ahora desea ver el mensaje de aviso.

source: It doesn't show up in the last error list, since the file with the warning wasn't compiled again.
es_es: No aparece en la última lista de errores ya que aún no se ha compilado el archivo con el aviso.

source: You can go back to the previous error list with: >
es_es: Puede volver a la lista de errores previa con: >

source: Then use ":clist" and ":cc {nr}" to jump to the place with the warning.
es_es: Use ahora «:clist» y «:cc {nr}» para saltar al lugar con el aviso.

source: To go forward to the next error list: >
es_es: Use lo siguiente para avanzar a la siguiente lista de errores: >

source: You have to tell Vim what format the error messages are that your compiler produces.
es_es: Tiene que indicar a Vim el formato de los mensajes de error que produce su compilador.

source: This is done with the 'errorformat' option.
es_es: Se puede hacer con la opción 'errorformat'.

source: The syntax of this option is quite complicated and it can be made to fit almost any compiler.
es_es: La sintaxis de esta opción es algo complicada, y puede hacer que encaje con prácticamente cualquier compilador.

source: You can find the explanation here: |errorformat|.
es_es: Puede encontrar la explicación aquí: |errorformat|.

source: You might be using various different compilers.
es_es: Puede que esté usando varios compiladores diferentes.

source: Setting the 'makeprg' option, and especially the 'errorformat' each time is not easy.
es_es: Definir la opción 'makeprg' y especialmente la opción 'errorformat' cada vez no es un tarea sencilla.

source: Vim offers a simple method for this.
es_es: Vim ofrece una forma sencilla de hacer esto.

source: For example, to switch to using the Microsoft Visual C++ compiler: >
es_es: Por ejemplo, para cambiar al compilador Microsoft Visual C++: >

source: This will find the Vim script for the "msvc" compiler and set the appropriate options.
es_es: Esta orden encontrará el script de Vim para el compilador «msvc» y definirá las opciones adecuadas.

source: You can write your own compiler files.
es_es: Puede escribir sus propios archivos de compilador.

source: See |write-compiler-plugin|.
es_es: Consulte |write-compiler-plugin|.

source: The ":make" command redirects the output of the executed program to an error file.
es_es: La orden «:make» redirige la salida del programa ejecutado a un archivo error.

source: How this works depends on various things, such as the 'shell'.
es_es: El modo en que esto último funciona depende de varias cosas, tales como la consola ('shell').

source: If your ":make" command doesn't capture the output, check the 'makeef' and 'shellpipe' options.
es_es: Si su orden «:make» no captura la salida, compruebe las opciones 'makeef' y 'shellpipe'.

source: The 'shellquote' and 'shellxquote' options might also matter.
es_es: Las opciones 'shellquote' y 'shellxquote' también son de importancia.

source: In case you can't get ":make" to redirect the file for you, an alternative is to compile the program in another window and redirect the output into a file.
es_es: En el caso de que no pueda hacer que «:make» redirija la salida del archivo, una alternativa es compilar el programa en otra ventana y redirigir la salida al archivo.

source: Then have Vim read this file with: >
es_es: Después, haga que Vim lea este archivo con: >

source: A program is much easier to understand when the lines have been properly indented.
es_es: Un programa es mucho más fácil de entender cuando las líneas tienen un sangrado adecuado.

source: Vim offers various ways to make this less work.
es_es: Vim ofrece varias formas de facilitar esto.

source: For C or C style programs like Java or C++, set the 'cindent' option.
es_es: Para programas C o con estilo C como Java o C++, defina la opción 'cindent'.

source: Vim knows a lot about C programs and will try very hard to automatically set the indent for you.
es_es: Vim sabe mucho acerca de programas C e intentará definir el sangrado automáticamente.

source: Set the 'shiftwidth' option to the amount of spaces you want for a deeper level.
es_es: Defina la opción 'shiftwidth' con el número de espacios que desea para cada nivel de profundidad.

source: Four spaces will work fine.
es_es: Cuatro espacios funcionarán bien.

source: One ":set" command will do it: >
es_es: Puede hacerlo con una orden 'set': >

source: When you type something in curly braces ({}), the text will be indented at the start and unindented at the end.
es_es: Cuando teclee algo entre llaves ({}), el texto tendrá un sangrado al inicio, pero no al final.

source: The unindenting will happen after typing the '}', since Vim can't guess what you are going to type.
es_es: La eliminación de sangrado («unindenting») aparecerá después de teclear '}', ya que Vim no puede adivinar qué va a escribir.

source: One side effect of automatic indentation is that it helps you catch errors in your code early.
es_es: Un efecto secundario del sangrado automático es que le permite encontrar los errores en su código de manera temprana.

source: When you type a } to finish a function, only to find that the automatic indentation gives it more indent than what you expected, there is probably a } missing.
es_es: Si teclea «}» para finalizar una función y ve que el sangrado automático la da más del esperado, puede que falte un «}».

source: Use the "%" command to find out which { matches the } you typed.
es_es: Use la orden «%» para encontrar qué «{» encaja con la «}» que introdujo.

source: A missing ) and ; also cause extra indent.
es_es: Un «)» y «;» omitido también causan un sangrado adicional.

source: Thus if you get more white space than you would expect, check the preceding lines.
es_es: Por ello, si obtiene más espacios en blanco del esperado, compruebe la líneas precedentes.

source: When you have code that is badly formatted, or you inserted and deleted lines, you need to re-indent the lines.
es_es: Cuando tiene código mal formateado, o si ha insertado o eliminado líneas, tendrá que sangrar las líneas nuevamente.

source: The "=" operator does this.
es_es: El operador «=» hace esto.

source: The simplest form is: >
es_es: La forma más simple es: >

source: However, don't do this in files that have been carefully indented manually.
es_es: Sin embargo, no lo haga en los archivos que han sido cuidadosamente sangrados manualmente.

source: The automatic indenting does a good job, but in some situations you might want to overrule it.
es_es: El sangrado automático hace un buen trabajo, pero en algunas situaciones puede que desee anularlo.

source: Different people have different styles of indentation.
es_es: Diferentes personas tienen diferentes estilos de sangrado.

source: By default Vim does a pretty good job of indenting in a way that 90% of programmers do.
es_es: Por omisión, Vim realiza un buen trabajo de sangrado de la manera en que lo hace el 90% de los programadores.

source: There are different styles, however; so if you want to, you can customize the indentation style with the 'cinoptions' option.
es_es: Aun así, hay diferentes estilos; así que si lo desea, puede personalizar el estilo de sangrado con la opción 'cinoptions'.

source: By default 'cinoptions' is empty and Vim uses the default style.
es_es: Por omisión, 'cinoptions' está vacío, usando Vim el estilo predeterminado.

source: You can add various items where you want something different.
es_es: Puede añadir varios elementos cuando desee algo diferente.

source: For example, to make curly braces be placed like this:
es_es: Por ejemplo, para ubicar llaves de la siguiente forma:

source: There are many of these items.
es_es: Hay muchos de estos elementos.

source: See |cinoptions-values|.
es_es: Consulte |cinoptions-values|.

source: You don't want to switch on the 'cindent' option manually every time you edit a C file.
es_es: No desea activar la opción 'cindent' manualmente cada vez que edite un archivo C.

source: This is how you make it work automatically: >
es_es: Esta es la forma de hacer que funcione automáticamente: >

source: Actually, this does a lot more than switching on 'cindent' for C files.
es_es: En realidad, esto hace mucho más que activar 'cindent' para archivos C.

source: First of all, it enables detecting the type of a file.
es_es: En primer lugar, activa la detección de tipo de archivo.

source: That's the same as what is used for syntax highlighting.
es_es: Es igual a lo usado para el resaltado de sintaxis.

source: When the filetype is known, Vim will search for an indent file for this type of file.
es_es: Si el tipo de archivo es conocido, Vim buscará un archivo de sangrado para este tipo de archivo.

source: The Vim distribution includes a number of these for various programming languages.
es_es: La distribución de Vim incluye un número para estos lenguajes de programación.

source: This indent file will then prepare for automatic indenting specifically for this file.
es_es: Este archivo de sangrado preparará automáticamente el sangrado específico para este archivo.

source: If you don't like the indenting for one specific type of file, this is how you avoid it.
es_es: Si no le gusta el sangrado para un tipo específico de archivo, esta es la forma de evitarlo.

source: Create a file with just this one line: >
es_es: Cree un archivo con sólo esta línea: >

source: The {filetype} is the name of the file type, such as "cpp" or "java".
es_es: El {tipo-de-archivo} es el nombre del tipo de archivo, por ejemplo, «cpp» o «java».

source: You can see the exact name that Vim detected with this command: >
es_es: Puede ver el nombre exacto de archivo que Vim ha detectado con la siguiente orden: >

source: Thus you would use "help" for {filetype}.
es_es: Entonces, usaría «help» para {tipo-de-archivo}.

source: For the {directory} part you need to use your runtime directory.
es_es: Para la parte de {directorio}, necesita usar su directorio de tiempo de ejecución.

source: Look at the output of this command: >
es_es: Mire la salida de esta orden: >

source: Now use the first item, the name before the first comma.
es_es: Ahora use el primer elemento, el nombre que precede a la primera coma.

source: Thus if the output looks like this:
es_es: Así, la salida tiene el siguiente aspecto:

source: You use "~/.vim" for {directory}.
es_es: Puede usar «~/.vim» para el {directorio}.

source: Then the resulting file name is:
es_es: Entonces, el nombre del archivo resultante es:

source: Instead of switching the indenting off, you could write your own indent file.
es_es: En lugar de desactivar el sangrado, podría escribir su propio archivo de sangrado.

source: How to do that is explained here: |indent-expression|.
es_es: La manera de hacerlo se explica aquí: |indent-expression|.

source: When you are using 'autoindent' or 'smartindent' to get the indent of the previous line, there will be many times when you need to add or remove one 'shiftwidth' worth of indent.
es_es: Cuando use 'autoindent' o 'smartindent' para obtener el sangrado de línea anterior, habrá ocasiones en que necesite añadir o eliminar un 'shiftwidth' de sangrado.

source: A quick way to do this is using the CTRL-D and CTRL-T commands in Insert mode.
es_es: La forma rápida de hacerlo es usando las órdenes «CTRL-D» y «CTRL-T» en modo Insertar.

source: For example, you are typing a shell script that is supposed to look like this:
es_es: Por ejemplo, está escribiendo un script de consola con el siguiente aspecto:

source: Now you see that you need an extra indent.
es_es: Ahora ve que necesita un sangrado adicional.

source: Type CTRL-T.
es_es: Pulse«CTRL-T».

source: The CTRL-T command, in Insert mode, adds one 'shiftwidth' to the indent, no matter where in the line you are.
es_es: La orden «CTRL-T», en modo Insertar, añade un 'shiftwidth' al sangrado sin importar en que línea está.

source: You continue typing the second line, <Enter> and the third line.
es_es: Continua escribiendo en la segunda línea, <Intro>, y la tercera línea.

source: This time the indent is OK.
es_es: Esta vez el sangrado es correcto.

source: Then <Enter> and the last line.
es_es: Pulse <Intro> y salte a la última línea.

source: Now you have this:
es_es: Ahora tiene lo siguiente:

source: To remove the superfluous indent in the last line press CTRL-D.
es_es: Para eliminar el sangrado innecesario en la última línea pulse «CTRL-D».

source: This deletes one 'shiftwidth' worth of indent, no matter where you are in the line.
es_es: Elimina un 'shiftwidth' de sangrado, sin importar dónde está dentro de la línea.

source: When you are in Normal mode, you can use the ">>" and "<<" commands to shift lines.
es_es: Cuando está en modo Normal, puede usar las órdenes «>>» y «<<» para cambiar las líneas.

source: ">" and "<" are operators, thus you have the usual three ways to specify the lines you want to indent.
es_es: «>» y «<» son operadores, y por ello tiene las tres formas habituales de definir las líneas que desea sangrar.

source: A useful combination is: >
es_es: Una combinación útil es la siguiente: >

source: Use a mix of <Tab> and space characters.
es_es: Use una mezcla de <Tab> y caracteres de espacio.

source: Since a <Tab> takes the place of eight spaces, you have fewer characters in your file.
es_es: Ya que <Tab> toma el el lugar de 8 espacios, tendrá menos caracteres en su archivo.

source: Inserting a <Tab> is quicker than eight spaces.
es_es: Insertar un <Tab> es más rápido que 8 espacios.

source: Backspacing works faster as well.
es_es: La tecla de retroceso también es más rápido.

source: Use spaces only.
es_es: Utilice espacios solamente.

source: This avoids the trouble with programs that use a different tabstop value.
es_es: Esto evita los problemas con los programas que utilizan un valor de «tabstop» diferente.

source: If you are using a combination of tabs and spaces, you just edit normally.
es_es: Si usa una combinación de tabulados y espacios, puede editar con normalidad.

source: The Vim defaults do a fine job of handling things.
es_es: El comportamiento predeterminado de Vim realiza un trabajo inteligente.

source: You can make life a little easier by setting the 'softtabstop' option.
es_es: Puede facilitar su vida definiendo la opción 'softtabstop'.

source: This option tells Vim to make the <Tab> key look and feel as if tabs were set at the value of 'softtabstop', but actually use a combination of tabs and spaces.
es_es: Esta opción le dice a Vim que la tecla <Tab> tenga el comportamiento como si los tabulados estuviesen definidos como un valor 'softtabstop', aunque use en realidad una combinación de tabulados y espacios.

source: After you execute the following command, every time you press the <Tab> key the cursor moves to the next 4-column boundary: >
es_es: Después de ejecutar la siguiente, orden, cada vez que pulse la tecla <Tab> el cursor se moverá al siguiente límite de cuatro columnas: >

source: When you start in the first column and press <Tab>, you get 4 spaces inserted in your text.
es_es: Cuando empiece en la primera columna y pulse <Tab> obtendrá la inserción de cuatro espacios en su texto.

source: The second time, Vim takes out the 4 spaces and puts in a <Tab> (thus taking you to column 8).
es_es: La segunda vez, Vim eliminará los cuatro espacios e insertará un <Tab> (llevándole a la columna 8).

source: Thus Vim uses as many <Tab>s as possible, and then fills up with spaces.
es_es: Entonces, Vim usa tantos <Tab> como sea posible, rellenándolos con espacios.

source: When backspacing it works the other way around.
es_es: Al usar la tecla de retroceso, funcionará al revés.

source: A <BS> will always delete the amount specified with 'softtabstop'.
es_es: Un <Bs> (tecla de retroceso) siempre elimina la cantidad definida con 'softtabstop'.

source: Then <Tab>s are used as many as possible and spaces to fill the gap.
es_es: Entonces, se usarán tantos <Tab> como sea posible, rellenando el hueco resultante con espacios.

source: The following shows what happens pressing <Tab> a few times, and then using <BS>.
es_es: Lo siguiente muestra lo que ocurre cuando pulsa <Tab> varias veces, y después usando <Bs>.

source: A "." stands for a space and "------->" for a <Tab>.
es_es: Un «.» simboliza un espacio, y «------->» un <Tab>.

source: type result ~ <Tab> ....
es_es: tipo resultado ~ <Tab> ....

source: An alternative is to use the 'smarttab' option.
es_es: Una alternativa es usar la opción 'smartab'.

source: When it's set, Vim uses 'shiftwidth' for a <Tab> typed in the indent of a line, and a real <Tab> when typed after the first non-blank character.
es_es: Si se define, Vim usa 'shiftwidth' para un <Tab> introducida en el sangrado de una línea, y un <Tab> real cuando se introduce en el primer carácter no vacío.

source: However, <BS> doesn't work like with 'softtabstop'.
es_es: Sin embargo <BS> no funciona de la misma forma que con 'softtabstop'.

source: When this option is set, the <Tab> key inserts a series of spaces.
es_es: Cuando se define esta opción, la tecla <Tab> inserte una serie de espacios.

source: Thus you get the same amount of white space as if a <Tab> character was inserted, but there isn't a real <Tab> character in your file.
es_es: Por ello, obtiene el mismo espacio en blanco que un carácter <Tab> inserta, aunque en realidad no hay ningún carácter <Tab> en su archivo.

source: The backspace key will delete each space by itself.
es_es: La tecla de retroceso eliminará cada espacio por sí mismo.

source: Thus after typing one <Tab> you have to press the <BS> key up to eight times to undo it.
es_es: Por ello, después de teclear un <Tab>, tendrá que pulsar la tecla <BS> (retroceso) hasta ocho veces para deshacerlo.

source: If you are in the indent, pressing CTRL-D will be a lot quicker.
es_es: Si está dentro de la sangría, pulsar «CTRL-D» es mucho más rápido.

source: Setting 'expandtab' does not affect any existing tabs.
es_es: Definir 'expandtab' no afecta a las tabulaciones existentes.

source: In other words, any tabs in the document remain tabs.
es_es: En otras palabras, todas las tabulaciones del documento siguen siéndolo.

source: If you want to convert tabs to spaces, use the ":retab" command.
es_es: Si desea convertir esas tabulaciones en espacios, use la orden «:retab».

source: Use these commands: >
es_es: Use las siguientes órdenes: >

source: Now Vim will have changed all indents to use spaces instead of tabs.
es_es: Ahora, Vim ha cambiado todas las sangrías para que usen espacios en lugar de tabulados.
